##  pandas 라이브러리와 pymysql

### 실습 환경 구축

* students.sql 을 Workbench 로 실행시키기

#### 데이터베이스 접속

In [1]:
import pymysql
import pandas as pd

In [2]:
host_name = 'localhost'
host_port = 3306
username = 'root'
password = '1234'
database_name = 'mywork'

In [3]:
db = pymysql.connect(
    host=host_name,     # MySQL Server Address
    port=host_port,          # MySQL Server Port
    user=username,      # MySQL username
    passwd=password,    # password for MySQL username
    db=database_name,   # Database name
    charset='utf8'
)

###  read_sql()
* pandas 라이브러리의 기능 중, read_sql() 메서드로 SQL 바로바로 확인하기

#### pandas.read_sql(쿼리, 연결된 db connection 객체)

In [5]:
SQL = "SHOW TABLES"

In [6]:
df = pd.read_sql(SQL, db)

In [7]:
df

       Tables_in_mywork
0            box_office
1       box_office_copy
2       covid19_country
3          covid19_data
4     covid19_summary_v
5           departments
6              dept_emp
7         dept_emp_test
8          dept_manager
9            emp_delete
10          emp_delete2
11        emp_hierarchy
12             emp_test
13            emp_test2
14            emp_tran1
15            emp_tran2
16          emp_update1
17          emp_update2
18            employees
19  highschool_students
20       my_first_table
21              product
22             qt_amt_v
23             salaries
24                 tbl1
25                 tbl2
26               titles

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame()

In [14]:
##df.to_sql("SELECT * FROM JOB", db)

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': not all arguments converted during string formatting

In [10]:
SQL = "SELECT * FROM departments"
df = pd.read_sql(SQL, db)
df

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d010                  IT
5    d001           Marketing
6    d004          Production
7    d006  Quality Management
8    d008            Research
9    d007               Sales

###  to_csv()
* pandas 라이브러리의 기능 중, to_csv() 메서드로 검색 결과 파일로 저장하기
  - csv 파일 포멧은 데이터간 콤마(,)로 구분해서 표시하는 단순 형식을 가지고 있음
  - csv 파일 포멧은 엑셀 프로그램에서도 읽고, 쓸 수 있음

In [11]:
df.to_csv('students.csv', sep=',', index=False, encoding='utf-8')
df

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d010                  IT
5    d001           Marketing
6    d004          Production
7    d006  Quality Management
8    d008            Research
9    d007               Sales